In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

/Users/zeev/.virtualenvs/science/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

#### pd.Series

In [5]:
s = pd.Series([1, 2, 3, 4, np.nan, 6])
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    6.0
dtype: float64

#### pd.DataFrame

In [4]:
dates = pd.date_range('20181119', periods=7)
dates

DatetimeIndex(['2018-11-19', '2018-11-20', '2018-11-21', '2018-11-22',
               '2018-11-23', '2018-11-24', '2018-11-25'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(7, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-11-19 -0.314492  0.037545  0.099808 -1.307579
2018-11-20 -0.224633  0.534234  1.660768  0.378448
2018-11-21 -1.745772  1.174089  0.665705  0.070575
2018-11-22  0.950198  1.249518 -0.536279  1.313715
2018-11-23 -1.040722 -1.666559 -0.276477  0.698090
2018-11-24  1.541927 -0.115470 -0.223904 -0.067986
2018-11-25 -1.046223  0.254216 -1.792357  1.688291

In [17]:
df_2 = pd.DataFrame({
    'A': 24.,
    'B': pd.Timestamp('20181119'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([4] * 4, dtype='int32'),
    'E': pd.Categorical(['train', 'test', 'val', 'pred']),
    'F': 'abcdef'
})
df_2

      A          B    C  D      E       F
0  24.0 2018-11-19  1.0  4  train  abcdef
1  24.0 2018-11-19  1.0  4   test  abcdef
2  24.0 2018-11-19  1.0  4    val  abcdef
3  24.0 2018-11-19  1.0  4   pred  abcdef

In [18]:
df_2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

#### visualization

In [19]:
df.head()

                   A         B         C         D
2018-11-19 -0.314492  0.037545  0.099808 -1.307579
2018-11-20 -0.224633  0.534234  1.660768  0.378448
2018-11-21 -1.745772  1.174089  0.665705  0.070575
2018-11-22  0.950198  1.249518 -0.536279  1.313715
2018-11-23 -1.040722 -1.666559 -0.276477  0.698090

In [21]:
df.tail(2)

                   A         B         C         D
2018-11-24  1.541927 -0.115470 -0.223904 -0.067986
2018-11-25 -1.046223  0.254216 -1.792357  1.688291

In [22]:
df.index

DatetimeIndex(['2018-11-19', '2018-11-20', '2018-11-21', '2018-11-22',
               '2018-11-23', '2018-11-24', '2018-11-25'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
df.values

array([[-0.31449173,  0.03754491,  0.09980773, -1.30757917],
       [-0.22463325,  0.5342341 ,  1.66076848,  0.37844825],
       [-1.74577173,  1.17408932,  0.66570498,  0.07057522],
       [ 0.95019827,  1.24951848, -0.53627863,  1.31371497],
       [-1.0407219 , -1.66655943, -0.27647707,  0.69808974],
       [ 1.54192705, -0.11547029, -0.22390424, -0.06798626],
       [-1.04622252,  0.25421631, -1.79235668,  1.68829065]])

In [26]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean  -0.268531  0.209653 -0.057534  0.396222
std    1.165506  0.981011  1.065740  0.985490
min   -1.745772 -1.666559 -1.792357 -1.307579
25%   -1.043472 -0.038963 -0.406378  0.001294
50%   -0.314492  0.254216 -0.223904  0.378448
75%    0.362783  0.854162  0.382756  1.005902
max    1.541927  1.249518  1.660768  1.688291

In [27]:
df.T

,2018-11-19 00:00:00,2018-11-20 00:00:00,2018-11-21 00:00:00,2018-11-22 00:00:00,2018-11-23 00:00:00,2018-11-24 00:00:00,2018-11-25 00:00:00
A,-0.314492,-0.224633,-1.745772,0.950198,-1.040722,1.541927,-1.046223
B,0.037545,0.534234,1.174089,1.249518,-1.666559,-0.115470,0.254216
C,0.099808,1.660768,0.665705,-0.536279,-0.276477,-0.223904,-1.792357
D,-1.307579,0.378448,0.070575,1.313715,0.698090,-0.067986,1.688291

In [30]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-11-19 -1.307579  0.099808  0.037545 -0.314492
2018-11-20  0.378448  1.660768  0.534234 -0.224633
2018-11-21  0.070575  0.665705  1.174089 -1.745772
2018-11-22  1.313715 -0.536279  1.249518  0.950198
2018-11-23  0.698090 -0.276477 -1.666559 -1.040722
2018-11-24 -0.067986 -0.223904 -0.115470  1.541927
2018-11-25  1.688291 -1.792357  0.254216 -1.046223

In [33]:
df.sort_index(by='D')
# ascending=False - from high to low

/Users/zeev/.virtualenvs/science/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

                   A         B         C         D
2018-11-19 -0.314492  0.037545  0.099808 -1.307579
2018-11-24  1.541927 -0.115470 -0.223904 -0.067986
2018-11-21 -1.745772  1.174089  0.665705  0.070575
2018-11-20 -0.224633  0.534234  1.660768  0.378448
2018-11-23 -1.040722 -1.666559 -0.276477  0.698090
2018-11-22  0.950198  1.249518 -0.536279  1.313715
2018-11-25 -1.046223  0.254216 -1.792357  1.688291

#### selection

In [34]:
df['A']

2018-11-19   -0.314492
2018-11-20   -0.224633
2018-11-21   -1.745772
2018-11-22    0.950198
2018-11-23   -1.040722
2018-11-24    1.541927
2018-11-25   -1.046223
Freq: D, Name: A, dtype: float64

In [35]:
df[0:3]

                   A         B         C         D
2018-11-19 -0.314492  0.037545  0.099808 -1.307579
2018-11-20 -0.224633  0.534234  1.660768  0.378448
2018-11-21 -1.745772  1.174089  0.665705  0.070575

In [36]:
df['20181119':'20181120']

                   A         B         C         D
2018-11-19 -0.314492  0.037545  0.099808 -1.307579
2018-11-20 -0.224633  0.534234  1.660768  0.378448

In [37]:
# select by label
df.loc[dates[0]]

A   -0.314492
B    0.037545
C    0.099808
D   -1.307579
Name: 2018-11-19 00:00:00, dtype: float64

In [39]:
df.loc[:, ['A', 'B']]

                   A         B
2018-11-19 -0.314492  0.037545
2018-11-20 -0.224633  0.534234
2018-11-21 -1.745772  1.174089
2018-11-22  0.950198  1.249518
2018-11-23 -1.040722 -1.666559
2018-11-24  1.541927 -0.115470
2018-11-25 -1.046223  0.254216

In [40]:
df.loc['20181119':'20181120',['A','B']]

                   A         B
2018-11-19 -0.314492  0.037545
2018-11-20 -0.224633  0.534234

In [41]:
df.loc['20181119',['A','B']]

A   -0.314492
B    0.037545
Name: 2018-11-19 00:00:00, dtype: float64

In [42]:
df.loc[dates[0],'A']

-0.31449173416562504

In [43]:
# same as .loc with fast access to a scalar
df.at[dates[0],'A']

-0.31449173416562504

In [44]:
# selection by position
df.iloc[2]

A   -1.745772
B    1.174089
C    0.665705
D    0.070575
Name: 2018-11-21 00:00:00, dtype: float64

In [45]:
df.iloc[3:5,0:2]

                   A         B
2018-11-22  0.950198  1.249518
2018-11-23 -1.040722 -1.666559

In [46]:
df.iloc[1:3,:]

                   A         B         C         D
2018-11-20 -0.224633  0.534234  1.660768  0.378448
2018-11-21 -1.745772  1.174089  0.665705  0.070575

In [47]:
df.iloc[:,1:3]

                   B         C
2018-11-19  0.037545  0.099808
2018-11-20  0.534234  1.660768
2018-11-21  1.174089  0.665705
2018-11-22  1.249518 -0.536279
2018-11-23 -1.666559 -0.276477
2018-11-24 -0.115470 -0.223904
2018-11-25  0.254216 -1.792357

In [48]:
# df.iloc[1,1]
df.iat[1,1]

0.5342340996498853

#### boolean indexing

In [49]:
df[df.A > 0]

                   A         B         C         D
2018-11-22  0.950198  1.249518 -0.536279  1.313715
2018-11-24  1.541927 -0.115470 -0.223904 -0.067986

In [51]:
df[df > 0]

                   A         B         C         D
2018-11-19       NaN  0.037545  0.099808       NaN
2018-11-20       NaN  0.534234  1.660768  0.378448
2018-11-21       NaN  1.174089  0.665705  0.070575
2018-11-22  0.950198  1.249518       NaN  1.313715
2018-11-23       NaN       NaN       NaN  0.698090
2018-11-24  1.541927       NaN       NaN       NaN
2018-11-25       NaN  0.254216       NaN  1.688291

####  setting

In [53]:
s1 = pd.Series([1,2,3,4,5,6,7], index=pd.date_range('20181119', periods=7))
s1

2018-11-19    1
2018-11-20    2
2018-11-21    3
2018-11-22    4
2018-11-23    5
2018-11-24    6
2018-11-25    7
Freq: D, dtype: int64

In [54]:
df['E'] = s1

In [55]:
df.at[dates[0], 'A'] = 0

In [56]:
df.iat[0, 1] = 0

In [57]:
df.loc[:,'D'] = np.array([5] * len(df))

In [58]:
df

                   A         B         C  D  E
2018-11-19  0.000000  0.000000  0.099808  5  1
2018-11-20 -0.224633  0.534234  1.660768  5  2
2018-11-21 -1.745772  1.174089  0.665705  5  3
2018-11-22  0.950198  1.249518 -0.536279  5  4
2018-11-23 -1.040722 -1.666559 -0.276477  5  5
2018-11-24  1.541927 -0.115470 -0.223904  5  6
2018-11-25 -1.046223  0.254216 -1.792357  5  7

In [59]:
df_2 = df.copy()
df_2[df_2 > 0] = -df_2
df_2

                   A         B         C  D  E
2018-11-19  0.000000  0.000000 -0.099808 -5 -1
2018-11-20 -0.224633 -0.534234 -1.660768 -5 -2
2018-11-21 -1.745772 -1.174089 -0.665705 -5 -3
2018-11-22 -0.950198 -1.249518 -0.536279 -5 -4
2018-11-23 -1.040722 -1.666559 -0.276477 -5 -5
2018-11-24 -1.541927 -0.115470 -0.223904 -5 -6
2018-11-25 -1.046223 -0.254216 -1.792357 -5 -7

#### missing data

In [61]:
df_1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['F'])
df_1

                   A         B         C  D  E   F
2018-11-19  0.000000  0.000000  0.099808  5  1 NaN
2018-11-20 -0.224633  0.534234  1.660768  5  2 NaN
2018-11-21 -1.745772  1.174089  0.665705  5  3 NaN
2018-11-22  0.950198  1.249518 -0.536279  5  4 NaN

In [63]:
df_1.dropna(how='any')
df_1

                   A         B         C  D  E   F
2018-11-19  0.000000  0.000000  0.099808  5  1 NaN
2018-11-20 -0.224633  0.534234  1.660768  5  2 NaN
2018-11-21 -1.745772  1.174089  0.665705  5  3 NaN
2018-11-22  0.950198  1.249518 -0.536279  5  4 NaN

In [64]:
df_1.fillna(value=0)
df_1

                   A         B         C  D  E   F
2018-11-19  0.000000  0.000000  0.099808  5  1 NaN
2018-11-20 -0.224633  0.534234  1.660768  5  2 NaN
2018-11-21 -1.745772  1.174089  0.665705  5  3 NaN
2018-11-22  0.950198  1.249518 -0.536279  5  4 NaN

### operations

#### stats

In [65]:
df.mean()

A   -0.223603
B    0.204290
C   -0.057534
D    5.000000
E    4.000000
dtype: float64

In [66]:
df.mean(1)

2018-11-19    1.219962
2018-11-20    1.794074
2018-11-21    1.618805
2018-11-22    2.132688
2018-11-23    1.403248
2018-11-24    2.440511
2018-11-25    1.883127
Freq: D, dtype: float64

In [69]:
s = pd.Series([1,3,5,np.nan,6,8, 9], index=dates).shift(2)
s

2018-11-19    NaN
2018-11-20    NaN
2018-11-21    1.0
2018-11-22    3.0
2018-11-23    5.0
2018-11-24    NaN
2018-11-25    6.0
Freq: D, dtype: float64

In [70]:
df.sub(s, axis='index')
df

                   A         B         C  D  E
2018-11-19  0.000000  0.000000  0.099808  5  1
2018-11-20 -0.224633  0.534234  1.660768  5  2
2018-11-21 -1.745772  1.174089  0.665705  5  3
2018-11-22  0.950198  1.249518 -0.536279  5  4
2018-11-23 -1.040722 -1.666559 -0.276477  5  5
2018-11-24  1.541927 -0.115470 -0.223904  5  6
2018-11-25 -1.046223  0.254216 -1.792357  5  7

#### apply

In [71]:
df.apply(np.cumsum)
df.apply(lambda x: x.max() - x.min())

A    3.287699
B    2.916078
C    3.453125
D    0.000000
E    6.000000
dtype: float64

#### histogramming

In [74]:
s = pd.Series(np.random.randint(0 ,5, size=10))
s

0    2
1    1
2    1
3    0
4    3
5    4
6    2
7    3
8    1
9    0
dtype: int64

In [75]:
s.value_counts()

1    3
3    2
2    2
0    2
4    1
dtype: int64

#### string methods

In [76]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

### merge

#### concat

In [78]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.779119 -2.283769  0.186844 -1.124390
1 -0.434973 -0.266821 -1.176355 -1.499945
2 -1.453031  0.344708 -0.602276 -1.126065
3 -0.184858  0.524676 -0.530099 -2.126093
4 -1.159692 -1.964022 -0.681250  2.878112
5 -0.278787 -1.485891 -2.197541  0.062322
6 -1.245239 -0.239958 -0.380908  0.612250
7  0.243248  1.758749  0.435721 -0.064311
8 -0.705619  0.284942 -1.293471  0.114714
9  0.460195 -0.179484 -0.633685 -0.034662

In [79]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.779119 -2.283769  0.186844 -1.124390
1 -0.434973 -0.266821 -1.176355 -1.499945
2 -1.453031  0.344708 -0.602276 -1.126065
3 -0.184858  0.524676 -0.530099 -2.126093
4 -1.159692 -1.964022 -0.681250  2.878112
5 -0.278787 -1.485891 -2.197541  0.062322
6 -1.245239 -0.239958 -0.380908  0.612250
7  0.243248  1.758749  0.435721 -0.064311
8 -0.705619  0.284942 -1.293471  0.114714
9  0.460195 -0.179484 -0.633685 -0.034662

#### join

In [80]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [81]:
left

   key  lval
0  foo     1
1  foo     2

In [82]:
right

   key  rval
0  foo     4
1  foo     5

In [83]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

#### append

In [84]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  1.548349 -0.028805  0.666021 -0.685614
1  0.412232 -0.690321  1.691081 -0.413179
2 -1.802436 -0.620125  0.536207  0.561336
3  2.487040 -1.476058 -0.610817  0.332331
4 -0.690714 -0.054136  1.568035  1.340811
5  0.098559 -1.766347 -1.964073 -0.536862
6  0.623852  0.634743 -0.872377  0.404530
7 -0.550621  1.179314 -0.120286  1.490543

In [85]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  1.548349 -0.028805  0.666021 -0.685614
1  0.412232 -0.690321  1.691081 -0.413179
2 -1.802436 -0.620125  0.536207  0.561336
3  2.487040 -1.476058 -0.610817  0.332331
4 -0.690714 -0.054136  1.568035  1.340811
5  0.098559 -1.766347 -1.964073 -0.536862
6  0.623852  0.634743 -0.872377  0.404530
7 -0.550621  1.179314 -0.120286  1.490543
8  2.487040 -1.476058 -0.610817  0.332331

#### grouping

In [86]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.169119  0.410292
1  bar    one  1.439932  1.473251
2  foo    two  1.550012  0.849196
3  bar  three  0.178508 -0.661349
4  foo    two  1.194641 -0.669454
5  bar    two  0.087808 -0.509471
6  foo    one  0.497625  1.116634
7  foo  three  0.668104  1.280921

In [87]:
df.groupby('A').sum()

            C         D
A
bar  1.706249  0.302431
foo  4.079500  2.987588

In [88]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.439932  1.473251
    three  0.178508 -0.661349
    two    0.087808 -0.509471
foo one    0.666744  1.526926
    three  0.668104  1.280921
    two    2.744653  0.179742

#### reshaping

In [89]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -1.247314  1.071972
      two     1.967387 -0.938298
baz   one    -0.537018 -1.607650
      two     0.810562 -0.550325
foo   one    -1.836947  0.021947
      two     1.279081 -0.181178
qux   one    -0.244000  0.594153
      two    -0.588223 -0.334459

In [90]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.247314  1.071972
      two     1.967387 -0.938298
baz   one    -0.537018 -1.607650
      two     0.810562 -0.550325

In [93]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -1.247314
               B    1.071972
       two     A    1.967387
               B   -0.938298
baz    one     A   -0.537018
               B   -1.607650
       two     A    0.810562
               B   -0.550325
dtype: float64

In [94]:
stacked.unstack()

                     A         B
first second
bar   one    -1.247314  1.071972
      two     1.967387 -0.938298
baz   one    -0.537018 -1.607650
      two     0.810562 -0.550325

In [95]:
stacked.unstack(1)

second        one       two
first
bar   A -1.247314  1.967387
      B  1.071972 -0.938298
baz   A -0.537018  0.810562
      B -1.607650 -0.550325

#### pivot tables

In [96]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.754142 -0.988409
1     one  B  foo  0.152287 -0.789681
2     two  C  foo -0.798388 -1.812494
3   three  A  bar  0.607513  1.394262
4     one  B  bar  1.121403 -1.270651
5     one  C  bar  0.273574 -0.567180
6     two  A  foo -0.380820  0.939954
7   three  B  foo -2.311833 -0.226994
8     one  C  foo  2.343881 -0.201741
9     one  A  bar -0.388593 -1.442269
10    two  B  bar -1.297039  0.135612
11  three  C  bar  0.342584 -0.524291

In [98]:
pd.pivot_table(df, values=['D', 'E'], index=['A', 'B'], columns=['C'])

                D                   E
C             bar       foo       bar       foo
A     B
one   A -0.388593  0.754142 -1.442269 -0.988409
      B  1.121403  0.152287 -1.270651 -0.789681
      C  0.273574  2.343881 -0.567180 -0.201741
three A  0.607513       NaN  1.394262       NaN
      B       NaN -2.311833       NaN -0.226994
      C  0.342584       NaN -0.524291       NaN
two   A       NaN -0.380820       NaN  0.939954
      B -1.297039       NaN  0.135612       NaN
      C       NaN -0.798388       NaN -1.812494

#### time series

In [99]:
rng = pd.date_range('11/19/2018', periods=100, freq='S')
rng

DatetimeIndex(['2018-11-19 00:00:00', '2018-11-19 00:00:01',
               '2018-11-19 00:00:02', '2018-11-19 00:00:03',
               '2018-11-19 00:00:04', '2018-11-19 00:00:05',
               '2018-11-19 00:00:06', '2018-11-19 00:00:07',
               '2018-11-19 00:00:08', '2018-11-19 00:00:09',
               '2018-11-19 00:00:10', '2018-11-19 00:00:11',
               '2018-11-19 00:00:12', '2018-11-19 00:00:13',
               '2018-11-19 00:00:14', '2018-11-19 00:00:15',
               '2018-11-19 00:00:16', '2018-11-19 00:00:17',
               '2018-11-19 00:00:18', '2018-11-19 00:00:19',
               '2018-11-19 00:00:20', '2018-11-19 00:00:21',
               '2018-11-19 00:00:22', '2018-11-19 00:00:23',
               '2018-11-19 00:00:24', '2018-11-19 00:00:25',
               '2018-11-19 00:00:26', '2018-11-19 00:00:27',
               '2018-11-19 00:00:28', '2018-11-19 00:00:29',
               '2018-11-19 00:00:30', '2018-11-19 00:00:31',
               '2018-11-19 00:00:32', '2018-11-19 00:00:33',
               '2018-11-19 00:00:34', '2018-11-19 00:00:35',
               '2018-11-19 00:00:36', '2018-11-19 00:00:37',
               '2018-11-19 00:00:38', '2018-11-19 00:00:39',
               '2018-11-19 00:00:40', '2018-11-19 00:00:41',
               '2018-11-19 00:00:42', '2018-11-19 00:00:43',
               '2018-11-19 00:00:44', '2018-11-19 00:00:45',
               '2018-11-19 00:00:46', '2018-11-19 00:00:47',
               '2018-11-19 00:00:48', '2018-11-19 00:00:49',
               '2018-11-19 00:00:50', '2018-11-19 00:00:51',
               '2018-11-19 00:00:52', '2018-11-19 00:00:53',
               '2018-11-19 00:00:54', '2018-11-19 00:00:55',
               '2018-11-19 00:00:56', '2018-11-19 00:00:57',
               '2018-11-19 00:00:58', '2018-11-19 00:00:59',
               '2018-11-19 00:01:00', '2018-11-19 00:01:01',
               '2018-11-19 00:01:02', '2018-11-19 00:01:03',
               '2018-11-19 00:01:04', '2018-11-19 00:01:05',
               '2018-11-19 00:01:06', '2018-11-19 00:01:07',
               '2018-11-19 00:01:08', '2018-11-19 00:01:09',
               '2018-11-19 00:01:10', '2018-11-19 00:01:11',
               '2018-11-19 00:01:12', '2018-11-19 00:01:13',
               '2018-11-19 00:01:14', '2018-11-19 00:01:15',
               '2018-11-19 00:01:16', '2018-11-19 00:01:17',
               '2018-11-19 00:01:18', '2018-11-19 00:01:19',
               '2018-11-19 00:01:20', '2018-11-19 00:01:21',
               '2018-11-19 00:01:22', '2018-11-19 00:01:23',
               '2018-11-19 00:01:24', '2018-11-19 00:01:25',
               '2018-11-19 00:01:26', '2018-11-19 00:01:27',
               '2018-11-19 00:01:28', '2018-11-19 00:01:29',
               '2018-11-19 00:01:30', '2018-11-19 00:01:31',
               '2018-11-19 00:01:32', '2018-11-19 00:01:33',
               '2018-11-19 00:01:34', '2018-11-19 00:01:35',
               '2018-11-19 00:01:36', '2018-11-19 00:01:37',
               '2018-11-19 00:01:38', '2018-11-19 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [102]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2018-11-19 00:00:00    429
2018-11-19 00:00:01    149
2018-11-19 00:00:02    410
2018-11-19 00:00:03    329
2018-11-19 00:00:04     22
2018-11-19 00:00:05    203
2018-11-19 00:00:06      4
2018-11-19 00:00:07     65
2018-11-19 00:00:08    116
2018-11-19 00:00:09    191
2018-11-19 00:00:10    473
2018-11-19 00:00:11    487
2018-11-19 00:00:12    496
2018-11-19 00:00:13    207
2018-11-19 00:00:14    105
2018-11-19 00:00:15    170
2018-11-19 00:00:16    401
2018-11-19 00:00:17      8
2018-11-19 00:00:18    451
2018-11-19 00:00:19    214
2018-11-19 00:00:20    304
2018-11-19 00:00:21     82
2018-11-19 00:00:22    243
2018-11-19 00:00:23    125
2018-11-19 00:00:24    132
2018-11-19 00:00:25    466
2018-11-19 00:00:26     19
2018-11-19 00:00:27     80
2018-11-19 00:00:28    270
2018-11-19 00:00:29    439
                      ...
2018-11-19 00:01:10     30
2018-11-19 00:01:11    459
2018-11-19 00:01:12    405
2018-11-19 00:01:13    362
2018-11-19 00:01:14    456
2018-11-19 00:01:15    294
2018-11-19 00:01:16    243
2018-11-19 00:01:17    311
2018-11-19 00:01:18     45
2018-11-19 00:01:19    294
2018-11-19 00:01:20    206
2018-11-19 00:01:21    416
2018-11-19 00:01:22    304
2018-11-19 00:01:23    281
2018-11-19 00:01:24    278
2018-11-19 00:01:25    414
2018-11-19 00:01:26    281
2018-11-19 00:01:27     61
2018-11-19 00:01:28    364
2018-11-19 00:01:29    480
2018-11-19 00:01:30    303
2018-11-19 00:01:31    176
2018-11-19 00:01:32     13
2018-11-19 00:01:33    463
2018-11-19 00:01:34    214
2018-11-19 00:01:35    219
2018-11-19 00:01:36    348
2018-11-19 00:01:37      6
2018-11-19 00:01:38    195
2018-11-19 00:01:39    166
Freq: S, Length: 100, dtype: int64

In [103]:
ts.resample('5Min').sum()

2018-11-19    25986
Freq: 5T, dtype: int64

In [104]:
rng = pd.date_range('11/19/2018 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts
ts_utc = ts.tz_localize('UTC')
ts_utc

2018-11-19 00:00:00+00:00    0.183970
2018-11-20 00:00:00+00:00    0.085480
2018-11-21 00:00:00+00:00    1.470206
2018-11-22 00:00:00+00:00   -0.205102
2018-11-23 00:00:00+00:00    3.025688
Freq: D, dtype: float64

In [105]:
ts_utc.tz_convert('US/Eastern')

2018-11-18 19:00:00-05:00    0.183970
2018-11-19 19:00:00-05:00    0.085480
2018-11-20 19:00:00-05:00    1.470206
2018-11-21 19:00:00-05:00   -0.205102
2018-11-22 19:00:00-05:00    3.025688
Freq: D, dtype: float64

In [106]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.144360
2012-02-29   -0.565984
2012-03-31   -1.648105
2012-04-30    0.675382
2012-05-31    0.515621
Freq: M, dtype: float64

In [110]:
ps = ts.to_period()
ps

2012-01   -0.144360
2012-02   -0.565984
2012-03   -1.648105
2012-04    0.675382
2012-05    0.515621
Freq: M, dtype: float64

In [111]:
ps.to_timestamp()

2012-01-01   -0.144360
2012-02-01   -0.565984
2012-03-01   -1.648105
2012-04-01    0.675382
2012-05-01    0.515621
Freq: MS, dtype: float64

In [112]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00    2.334049
1990-06-01 09:00   -0.458845
1990-09-01 09:00    0.326924
1990-12-01 09:00    0.481272
1991-03-01 09:00    0.144064
Freq: H, dtype: float64

#### categoricals

In [113]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [114]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [116]:
df["grade"].cat.categories = ["very good", "good", "very bad"]
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [117]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [118]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good